app/controllers/tracks_controller.rb

  def index
    @tracks = Track.all
---
SELECT "tracks".* FROM "tracks" WHERE (email_address = '.com')  ORDER BY tracks.email_address ASC

  def create
    @track = Track.new(track_params)

    respond_to do |format|
      if @track.save
---
INSERT INTO "tracks" ("first_name", "last_name", "email_address", "company_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", ""], ["last_name", ""], ["email_address", ""], ["company_name", ""], ["created_at", "2017-08-02 06:46:36.478884"], ["updated_at", "2017-08-02 06:46:36.478884"]]

  def update
    respond_to do |format|
      if @track.update(track_params)
---
UPDATE "tracks" SET "first_name" = ?, "last_name" = ?, "email_address" = ?, "phone_number" = ?, "company_name" = ?, "updated_at" = ? WHERE "tracks"."id" = ?  [["first_name", "last"], ["last_name", "last2"], ["email_address", "nhgf"], ["phone_number", 2345.0], ["company_name", "sdfghhg"], ["updated_at", "2017-08-02 06:47:11.810754"], ["id", 7]]